Agile/scrumestimatingexp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Scrum Estimating Experiences</title>
<!-- 2016-02-02 Tue 21:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Scrum Estimating Experiences</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Team A - Desktop Product Team</a></li>
<li><a href="#sec-3">Team B - Service Development Team</a></li>
<li><a href="#sec-4">What we are trying to achieve with estimates</a>
<ul>
<li><a href="#sec-4-1">Backlog Management</a></li>
<li><a href="#sec-4-2">Velocity</a></li>
<li><a href="#sec-4-3">Dangers</a></li>
</ul>
</li>
<li><a href="#sec-5">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I recently posted about Estimating in Scrum and why time based
estimating can be problematic and why a focus on the team enables
estimation and velocity to be more than just a measure of effort.
</p>

<p>
However, we have some very different teams trying to use Scrum,
where the assumptions made in that post only partially apply, so I
thought I'd share some of my experiences and thoughts on how to
manage estimating. As with all Scrum projects, we are in a constant
state of inspect and adapt, so these thoughts are based on my
understanding on the date of the post and may change over time. We
are constantly looking to improve the team's ability to deliver
business value in a predictable and incremental manner in a way that
can cope with the shifting priorities of the business.
</p>

<p>
It is also worth mentioning that these teams are small, so the
impact of resourcing changes have a significant impact on Velocity
and make planning a challenge.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Team A - Desktop Product Team</h2>
<div class="outline-text-2" id="text-2">
<p>
This team is responsible for the development of a desktop product,
currently consists of 2 dedicated  developers and 1 non-dedicated
tester. By dedicated I obviously mean resource wise, not motivation
wise :) There is a strong sense of 'team' in Team A, despite some
remote working going on, so the following assumptions hold true:
</p>

<ol class="org-ol">
<li>The team can estimate well in a relative manner and come to a
consensus on the point value of a story.
</li>
<li>The team can organise itself well to manage the sprint backlog
and work together, help each other etc.
</li>
<li>There is a strong sense of the team committing to a sprint,
rather than individuals.
</li>
<li>Therefore, a consensus based estimation as outlined in my
previous post seems to be working quite well and the last 3
sprints (out of a total of 4) velocity have been consistent, with
expectation of an increase in velocity becoming apparent over
time.
</li>
</ol>

<p>
There is lots of room for improvement in this team, particularly in
terms of backlog management and definition of done / feature
completion, but we're getting there and its all smiles: Scrum looks
like it is working.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Team B - Service Development Team</h2>
<div class="outline-text-2" id="text-3">
<p>
This team is very different. It currently has 3 developers, 2 of
whom are not dedicated and again one non dedicated tester. As the
product is made up of a large collection of deployable components,
the responsibility for an individual component usually rests on the
shoulders of an individual developer. The sense of 'team' is less
than that of Team A. This is the nature of the product and not a
reflection of the teams ability to work as a team. The team is also
distibuted around the UK and physically meet up Monday mornings for
sprint planning.
</p>

<p>
The team also has a backlog that is proving difficult to estimate as
the features are more Epics than Stories. This is being addresses by
the PO. However, questions are being raised as to how to 'do
Architecture' with Scrum. This is a subject outside the scope of
this post, hoepfully I can come back to it later.
</p>

<p>
We therefore find that the assumptions that hold true for team A do
not hold true for team B and it is questionable whether estimation
should be a consensus, when the commitment to deliver a Story is
placed on an individual.
</p>

<p>
So how do we go about estimating these stories?
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">What we are trying to achieve with estimates</h2>
<div class="outline-text-2" id="text-4">
<p>
So back to basics, what are estimates in Scrum trying to achieve.
</p>

<ol class="org-ol">
<li>Relative effort required to complete a story can be calculated.
</li>
<li>Velocity of development can be measured
</li>
<li>Based on velocity, resource capacity and backlog size, roadmaps
can be managed
</li>
<li>Product release can be managed
</li>
</ol>

<p>
Ultimately we are trying to achieve the predictable release of the
product, by managing our expectation that is based on velocity and
the relative size of features.
</p>

<p>
In Team A, the estimates and velocity are related to the team and it
all works (more or less) very nicely, but here is where we come up
against our first problem in Team B. Stories are not 'owned' by the
team but 'owned' by an individual. We have to look at a way of
measuring velocity and estimating that recognises the way the
product is developed:
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Backlog Management</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The backlog needs estimating, we have decided not to use a
consensus, but rather the assigned developer will estimate
it. Therefore when we estimate the backlog, we assign a developer
to that Story and take their estimate, along with the testers
estimate. Our backlog could then become partitioned into 'Developer
Backlogs' - TFS helps us manage this quite nicely. If a Story is
moved from one developer to another, then it is re-estimated. This
may throw our Release burndown, but then you would want it to, as
the developer change may imply that it will take a different length
of time to deliver. The individual developer can then estimate
relatively to their own set of stories.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Velocity</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The velocity of each individual developer then needs to be measured
AND NOT COMPARED TO EACH OTHER. From this a Developer burndown can
be produced giving the PO an idea as to when the individual
backlogs will be complete.
</p>

<p>
As the product progresses and stories shift developer, it makes the
task of managing release a little more complicated as the Product
Backlog (the complete backlog) will only be complete when the last
developer has completed their backlog. I would expect that this may
necessitate shifting stories between developers as mentioned above.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Dangers</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The dangers of doing this way is that the team is not accountable
as a team, but rather as individuals, which can of course cause all
kinds of problems between them. For example, as stated above, an
individual's velocity should not be measured against another's. It
becomes even more important to not estimate in time as a result as
there could be all kinds of conclusions drawn on developers
relative velocity that would not be helpful for both the individual
and the product.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Summary</h2>
<div class="outline-text-2" id="text-5">
<p>
In the real world, teams are never ideal teams. There is often
resource that is non dedicated, and teams often work with a specific
responsibility for a product component. All of this makes for a
scenario where Scrum has to be adapted to perform in a way to meet
the goals it intends to achieve. With a bit of thought this is
possible, but not without its dangers. Managing the Product Backlog
as a set of Developer Backlogs may be a way forward and only time
will tell.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-02 Tue 21:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
